# Tonne Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Tonne Property
SymbolTypeId Class See Also
---
Symbol t, indicating unit Tonnes.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Tonne { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Tonne As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Tonne {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace